<script setup name="ModelAndAlgorithmPop">
// 智能要素-模型 弹出窗
import PopModelPanel from './PopModelPanel.vue'

const props = defineProps({
  modelValue: {
    type: Boolean,
    default: false
  },

  isModel: {
    type: Boolean,
    default: true
  }
})

const emit = defineEmits(['update:modelValue'])

const visible = computed({
  get: () => props.modelValue,
  set: (val) => {
    emit('update:modelValue', val)
  }
})

const list = computed(() => {
  const modelList = [
    { title: '智能外呼模块', content: '基于保护个人隐私的前提下，借助运营商“虚拟小号”的成熟技术，在政务服务和公共服务领域，为服务主体和服务对象双方提供一键虚拟通话，保障双方隐私。可应用于便民挪车、基层回访、网约护士等服务场景。例如，在基层回访应用场景，在基层工作人员发起与群众通话申请时，系统从储备号码池中随机分配一个中间号(虚拟小号）进行通话。同时，在预设的效期内，群众可以通过中间号正常回拨联系到基层工作人员。有效期后，群众需从系统重新发起通话申请联系相应的基层工作人员。' },
    { title: '数字孪生白模可视化分析模型…', content: '基于数字孪生三维地图模块，提供全市基础白模孪生服务，结合多维度指标、标签等融合分析，如经济分析、亩均分析、人口分析、危房分析、学区分析、疫情分析、监测流量分析等，以各种热力、分色、标签等形式动态立体可视化展示，可用于规划宏观分析、人员精准定位、效益精确分析、疫情直观管控、监测智能分析等' },
    { title: '资源周边分析模块', content: '针对医疗卫生、教育、文化、体育、交通、旅游、餐饮等各类数据空间可视化需求，将业务数据与孪生可视化实体数据进行数据关联、比对、清洗，实现业务数据和孪生可视化实体数据的进行关联，形成可在三维地图上叠加展示的资源图层。根据资源的空间位置信息，进行周边自定义范围（100m、200m范围）的周边信息点位进行查询分析（如：监控摄像头、周边人员、医院、学校、银行等分类信息），获得周边信息清单，并按距离远近排列。能够为各部门提供更加及时、快速、便捷和可靠的决策依据，为政府科学管' },
    { title: '地名地址反向匹配模型', content: '提供空间位置反向匹配服务接口，输入目标点的经纬度坐标信息，实现可返回离该目标点最近的标准地址信息，包括该目标点所在的区县名、乡镇街道名、村社区名、网格名、小区大厦名等，可用于疫情防控、防汛防台、应急处突、社会治理、便民服务等。' },
    { title: '资源周边分析模块', content: '针对医疗卫生、教育、文化、体育、交通、旅游、餐饮等各类数据空间可视化需求，将业务数据与孪生可视化实体数据进行数据关联、比对、清洗，实现业务数据和孪生可视化实体数据的进行关联，形成可在三维地图上叠加展示的资源图层。根据资源的空间位置信息，进行周边自定义范围（100m、200m范围）的周边信息点位进行查询分析（如：监控摄像头、周边人员、医院、学校、银行等分类信息），获得周边信息清单，并按距离远近排列。能够为各部门提供更加及时、快速、便捷和可靠的决策依据，为政府科学管' },
    { title: '地名地址反向匹配模型', content: '提供空间位置反向匹配服务接口，输入目标点的经纬度坐标信息，实现可返回离该目标点最近的标准地址信息，包括该目标点所在的区县名、乡镇街道名、村社区名、网格名、小区大厦名等，可用于疫情防控、防汛防台、应急处突、社会治理、便民服务等。' },
  ]
  const algorithmList = [
    {
      "title": "人流密度检测",
      "content": "1、算法使用场景：需结合需要监测人流密度的场景的监控视频；\n2、算法识别区域：可根据业务需要，手动划定视频中的全部或部分区域为算法检测区域，非算法检测区域算法不检测；\n3、算法使用要求：需在光线充足、无明显遮挡、目标检测物大小适宜且肉眼清晰可辨的条件下使用；\n4、算法目标检测物：人体头部；\n5、算法描述：支持实时分析检测监控区域内目标检测物的数量，算法可设置人数阀值，当数量超过阀值，算法需立即以json的形式输出带有报警标志、报警截图的结果。"
    },
    {
      "title": "楼内消防门堵塞检测",
      "content": "1、算法使用场景：需结合存在楼内消防门场景的监控视频；\n2、算法识别区域：可根据业务需要，手动划定视频中的全部或部分区域为算法检测区域，非算法检测区域算法不检测；\n3、算法使用要求：需在光线充足、无明显遮挡、目标检测物大小适宜且肉眼清晰可辨的条件下使用；\n4、算法目标检测物：大件物体；\n5、算法描述：支持实时分析检测监控区域内是否存在目标检测物堵塞在消防门前的情况，若存在，算法需立即以json的形式输出带有报警标志、报警截图的结果。"
    },
    {
      "title": "路面消防通道堵塞检测",
      "content": "1、算法使用场景：需结合存在路面消防通道场景的监控视频；\n2、算法识别区域：可根据业务需要，手动划定视频中的全部或部分区域为算法检测区域，非算法检测区域算法不检测；\n3、算法使用要求：需在光线充足、无明显遮挡、目标检测物大小适宜且肉眼清晰可辨的条件下使用；\n4、算法目标检测物：机动车；\n5、算法描述：支持实时分析检测监控区域内是否存在目标检测物长时间（可配置）堵塞路面消防通道的情况，若存在，算法需立即以json的形式输出带有报警标志、报警截图的结果。"
    },
    {
      "title": "烟雾检测",
      "content": "1、算法使用场景：需结合容易出现烟雾场景的监控视频；\n2、算法识别区域：可根据业务需要，手动划定视频中的全部或部分区域为算法检测区域，非算法检测区域算法不检测；\n3、算法使用要求：需在光线充足、无明显遮挡、目标检测物大小适宜且肉眼清晰可辨的条件下使用；\n4、算法目标检测物：烟雾（白烟、青烟）；\n5、算法描述：支持实时分析检测监控区域内是否出现目标检测物，若出现，算法需立即以json的形式输出带有报警标志、报警截图的结果。"
    },
    {
      "title": "火焰检测",
      "content": "1、算法使用场景：需结合容易出现火焰场景的监控视频；\n2、算法识别区域：可根据业务需要，手动划定视频中的全部或部分区域为算法检测区域，非算法检测区域算法不检测；\n3、算法使用要求：需在光线充足、无明显遮挡、目标检测物大小适宜且肉眼清晰可辨的条件下使用；\n4、算法目标检测物：火焰；\n5、算法描述：支持实时分析检测监控区域内是否出现目标检测物，若出现，算法需立即以json的形式输出带有报警标志、报警截图的结果。"
    },
    {
      "title": "电梯间电动车检测",
      "content": "1、算法使用场景：需结合电梯间内的监控视频；\n2、算法识别区域：可根据业务需要，手动划定视频中的全部或部分区域为算法检测区域，非算法检测区域算法不检测；\n3、算法使用要求：需在光线充足、无明显遮挡、目标检测物大小适宜且肉眼清晰可辨的条件下使用；\n4、算法目标检测物：电动车（电动自行车、电动摩托车）；\n5、算法描述：支持实时分析检测监控区域内是否出现目标检测物，若出现，算法需立即以json的形式输出带有报警标志、报警截图的结果。"
    }
  ]
  return props.isModel ? modelList : algorithmList
})

</script>

<template>
  <Popup v-model="visible">
    <template #header="{ titleId, titleClass }">
      <div class="my-header">
        <div
          :id="titleId"
          :class="titleClass"
        >
          智能要素
          <span class="subtitle">{{ props.isModel ? '模型' : '算法' }}</span>
        </div>
      </div>
    </template>
    <div class="content-wrap">
      <template v-for="item in list">
        <PopModelPanel :modelValue="item" />
      </template>
    </div>
  </Popup>
</template>

<style lang="scss" scoped>
.my-header {
  position: absolute;
  left: 0;
  top: 0;
  width: 220px;

  :deep(.ep-dialog__title) {
    width: 300px;

    &::before {
      right: 95px;
    }
  }

  .subtitle {
    position: absolute;
    right: 20px;
    z-index: 99;
  }
}

.content-wrap {
  padding: 29px 50px;
  display: flex;
  flex-wrap: wrap;
  height: 100%;
  overflow: auto;
}
</style>