<script setup name="GovLeadersPop">
// 智能要素弹出窗
import PopPanel from './PopPanel.vue'

const props = defineProps({
  modelValue: {
    type: Boolean,
    default: false
  }
})

const emit = defineEmits(['update:modelValue'])

const visible = computed({
  get: () => props.modelValue,
  set: (val) => {
    emit('update:modelValue', val)
  }
})

const list = ref([
  { title: '智能外呼模块', content: '基于保护个人隐私的前提下，借助运营商“虚拟小号”的成熟技术，在政务服务和公共服务领域，为服务主体和服务对象双方提供一键虚拟通话，保障双方隐私。可应用于便民挪车、基层回访、网约护士等服务场景。例如，在基层回访应用场景，在基层工作人员发起与群众通话申请时，系统从储备号码池中随机分配一个中间号(虚拟小号）进行通话。同时，在预设的效期内，群众可以通过中间号正常回拨联系到基层工作人员。有效期后，群众需从系统重新发起通话申请联系相应的基层工作人员。' },
  { title: '数字孪生白模可视化分析模型…', content: '基于数字孪生三维地图模块，提供全市基础白模孪生服务，结合多维度指标、标签等融合分析，如经济分析、亩均分析、人口分析、危房分析、学区分析、疫情分析、监测流量分析等，以各种热力、分色、标签等形式动态立体可视化展示，可用于规划宏观分析、人员精准定位、效益精确分析、疫情直观管控、监测智能分析等' },
  { title: '资源周边分析模块', content: '针对医疗卫生、教育、文化、体育、交通、旅游、餐饮等各类数据空间可视化需求，将业务数据与孪生可视化实体数据进行数据关联、比对、清洗，实现业务数据和孪生可视化实体数据的进行关联，形成可在三维地图上叠加展示的资源图层。根据资源的空间位置信息，进行周边自定义范围（100m、200m范围）的周边信息点位进行查询分析（如：监控摄像头、周边人员、医院、学校、银行等分类信息），获得周边信息清单，并按距离远近排列。能够为各部门提供更加及时、快速、便捷和可靠的决策依据，为政府科学管' },
  { title: '地名地址反向匹配模型', content: '提供空间位置反向匹配服务接口，输入目标点的经纬度坐标信息，实现可返回离该目标点最近的标准地址信息，包括该目标点所在的区县名、乡镇街道名、村社区名、网格名、小区大厦名等，可用于疫情防控、防汛防台、应急处突、社会治理、便民服务等。' },
  { title: '资源周边分析模块', content: '针对医疗卫生、教育、文化、体育、交通、旅游、餐饮等各类数据空间可视化需求，将业务数据与孪生可视化实体数据进行数据关联、比对、清洗，实现业务数据和孪生可视化实体数据的进行关联，形成可在三维地图上叠加展示的资源图层。根据资源的空间位置信息，进行周边自定义范围（100m、200m范围）的周边信息点位进行查询分析（如：监控摄像头、周边人员、医院、学校、银行等分类信息），获得周边信息清单，并按距离远近排列。能够为各部门提供更加及时、快速、便捷和可靠的决策依据，为政府科学管' },
  { title: '地名地址反向匹配模型', content: '提供空间位置反向匹配服务接口，输入目标点的经纬度坐标信息，实现可返回离该目标点最近的标准地址信息，包括该目标点所在的区县名、乡镇街道名、村社区名、网格名、小区大厦名等，可用于疫情防控、防汛防台、应急处突、社会治理、便民服务等。' },
])

</script>

<template>
  <Popup
    v-model="visible"
    title="智能要素"
  >
    <div class="content-wrap">
      <template v-for="item in list">
        <PopPanel :modelValue="item" />
      </template>
    </div>
  </Popup>
</template>

<style lang="scss" scoped>
.content-wrap {
  padding: 29px 50px;
  display: flex;
  flex-wrap: wrap;
  height: 100%;
  overflow: auto;
}
</style>