<script setup name="AssessmentPop">
import { getDoubleMoon } from '@/api'

const props = defineProps({
  modelValue: {
    type: Boolean,
    default: false
  }
})

const emit = defineEmits(['update:modelValue'])

const visible = computed({
  get: () => props.modelValue,
  set: (val) => {
    emit('update:modelValue', val)
  }
})

const columns = ref([
  {
    key: `col0`,
    label: `双月工作任务名称`,
  },
  {
    key: `col1`,
    label: `完成时限`,
  },
  {
    key: `col2`,
    label: `双月工作推进举措`,
  },
  {
    key: `col3`,
    label: `工作状态`,
  },
  {
    key: `col4`,
    dataKey: `col4`,
  },
  {
    key: `col5`,
    label: `牵头单位`,
  }
])
const tableList = ref([])
const titleList = ref([
  '强化党对基层治理的全面领导（市委组织部牵头，市委编办协同）',
  '迭代升级“141”体系（市委政法委牵头，市委办公室、市委编办、市大数据局协同）',
  '推进重大应用全面贯通（市大数据局牵头，市委编办协同）',
  '四、推进基层治理“一件事”集成改革（市委改革办牵头，市委编办协同）',
  '推进基层智治大脑建设（市大数据局牵头，市委办公室协同）',
  '大综合一体化” 行政执法改革（市综合行政执法局、市委编办共同牵头）',
  '完善“四治融合”城乡基层治理体系（市委农办牵头，市委宣传部、市民政局、市司法局协同）'
])

const getData = async () => {
  const resData = {
    "list1": [
      [
        "贯彻落实省委《关于党建统领网格智治推进基层治理体系和治理能力现代化的指导意见》",
        "5月底",
        "对照省委《指导意见》，做好重点任务分解，明确相关部门职责分工",
        "已完成",
        "印发《党建统领网格智治推进基层治理体系和治理能力现代化<指导意见>任务责任清单》，明确39项具体任务，并实行全过程跟踪督办。",
        "市委组织部"
      ],
      [
        "贯彻落实省委《关于党建统领网格智治推进基层治理体系和治理能力现代化的指导意见》",
        "6月中旬",
        "开展无物业小区管理清零行动，因地制宜设置楼栋党小组，除规模较小的小区外基本实现党组织全覆盖，条件成熟的组建业主委员会",
        "已完成",
        "已实现393个无物业小区党组织全覆盖（规模较小的18个小区由村社党组织覆盖）。",
        "市委组织部"
      ],
      [
        "贯彻落实省委《关于党建统领网格智治推进基层治理体系和治理能力现代化的指导意见》",
        "12月底",
        "调整优化网格设置，建强网格党组织，配齐“1+3+N”网格力量",
        "未开始",
        "召开全市网格建设工作调度会，对网格建设作出具体部署，6月底前完成网格优化；目前已启动8个县（市、区）的新一轮专职社工招聘，预计可增配913名专职社区工作者。",
        "市委组织部"
      ],
      [
        "开展乡镇领导班子换届“回头看”",
        "6月底",
        "围绕新任班子相容度、班子成员胜任度、年轻干部适岗度、党员群众满意度“四度”，开展乡镇换届“回头看”，及时调整优化班子结构",
        "已完成",
        "累计谈话3865名乡镇干部，同步排摸确定“两头”人选393名，并逐个乡镇推演形成优化方案。",
        "市委组织部"
      ],
      [
        "完善党建引领的社会参与机制",
        "持续推进",
        "推广瓯海村社“三色管理”、永嘉“以房管人”“数字扫楼”等做法，大力探索党建联盟、党建共同体等新形态",
        "未开始",
        "将全市去年组建的党建联盟科学优化调整为809个，按照引领型10%、示范型20%、达标型70%的数量比例分类开展创建。目前已初步创建95个涵盖不同类型、不同领域的引领型党建联盟。",
        "市委组织部"
      ],
      [
        "健全乡镇（街道）机构职能体系",
        "6月上旬",
        "贯彻落实省委编办《关于加强乡镇（街道）机构编制统筹管理推进数字化改革“1612”体系建设的意见》，推动编制资源力量下沉",
        "未完成",
        "鹿城、乐清、瑞安、泰顺等地已建立乡镇（街道）编制周转池，并实质性运行。",
        "市委编办"
      ],
      [
        "健全乡镇（街道）机构职能体系",
        "6月底",
        "出台《关于进一步规范县（市、区）机构编制事项审核审批管理的通知》",
        "已完成",
        "完成《关于进一步规范县（市、区）机构编制事项审核审批管理的通知》制定。",
        "市委编办"
      ],
      [
        "健全乡镇（街道）机构职能体系",
        "持续推进",
        "优化完善乡镇（街道）权力清单、政务服务清单、“属地管理”事项责任清单，建立健全事项清单准入、调整和评估机制，完善工作闭环",
        "未开始",
        "各地均已完成乡镇（街道）权力清单、政务服务清单、“属地管理”事项责任清单的优化调整工作，并建立健全了事项清单准入、调整和评估机制。",
        "市委编办"
      ],
      [
        "强化城乡社区治理",
        "持续推进",
        "推进“共享社·幸福里”建设，打造近1000个小区（社区、农村）建设单元，统一“标准、标配、标志”",
        "未开始",
        "已建立“共享社·幸福里”标准、标配、标志，并加速推进第二批419个建设单元。",
        "市委组织部"
      ],
      [
        "强化城乡社区治理",
        "6月下旬",
        "按每个网格原则上覆盖300-500户标准推动科学设置网格，对红色、黄色管理的融合型大社区大单元，一般按照200-300户标准进一步划细划小，并相应调整完善网格党组织设置",
        "已完成",
        "会同政法、民政、公安等单位召开全市网格建设逐县过筛审核会，经两轮过筛，从7895个网格已优化调整至10278个。",
        "市委组织部"
      ],
      [
        "强化城乡社区治理",
        "持续推进",
        "按照“急需、分步”原则加大专职社工配备力度，年底前融合型大社区大单元等情况复杂的社区全部配备到位",
        "未开始",
        "截至6月底，已配备专职社区工作者2711人。",
        "市民政局"
      ],
      [
        "强化城乡社区治理",
        "5月底",
        "出台实施《温州市社区工作指导员、社区第一书记暂行管理办法》，选派第一批社区工作指导员、社区第一书记",
        "已完成",
        "召开市派农村工作指导员和首轮社区工作指导员任前培训班，下派32名社区工作指导员，制定出台《温州市社区工作指导员、社区第一书记管理暂行办法》。",
        "市委组织部"
      ],
      [
        "强化城乡社区治理",
        "持续推进",
        "常态落实包联包户，县级领导班子全覆盖包联全市村社，抓紧开展“敲门行动”、模拟演练，增强疫情防控执行作战能力",
        "未开始",
        "持续做好“抗疫情、创文明、保平安”党员干部下沉包联工作，日均发动700多人下沉。",
        "市委组织部"
      ],
      [
        "强化城乡社区治理",
        "持续推进",
        "承接贯通“浙里红色根脉强基工程”应用，做好融合型大社区大单元党建应用场景开发建设",
        "未开始",
        "依托“共享社·幸福里”（智慧村社）应用，自动采集、分析汇总71个社区（融合型大社区大单元）社区干部、工作动态、考勤打卡、三务公开等5类数据指标。",
        "市委组织部"
      ]
    ], //
    "list2": [
      [
        "统筹推进“141”体系迭代升级",
        "6月中旬",
        "研究制定“141”体系迭代升级方案",
        "已完成",
        "初步完成《温州市“141”基层治理体系迭代升级方案（讨论稿）》。",
        "市委政法委"
      ],
      [
        "推进县级社会治理中心建设",
        "6月底",
        "按照6大功能调整县级社会治理中心功能模块，调配工作力量，建立健全机制",
        "未完成",
        "目前，12个县（市、区）均已完成社会治理中心挂牌，部分县（市、区）已开始对接市委编委进行更名。各县（市、区）常委会或主要领导多次研究县级社会治理中心人员调整、机制健全等事宜。",
        "市委政法委\n市委编办"
      ],
      [
        "推进县级社会治理中心建设",
        "持续推进",
        "年底前县（市、区）全面完成“社会治理中心”“城市运行管理中心”一体融合",
        "未开始",
        "各地正按照改革进度，积极推进社会治理中心和城市运行管理中心“一体融合”。我市第一个城市运行和社会治理中心在瓯海区正式揭牌。",
        "市委政法委\n市委改革办"
      ],
      [
        "推进县级社会治理中心建设",
        "持续推进",
        "指导龙港市实施“市管社区”扁平化基层治理改革，重塑基层治理结构，建立数字化支撑体系和扁平化指挥体系",
        "未开始",
        "指导实施大部制改革2.0版，部门干部模块化服务社区，建设“一网统管”平台，打通9个系统，指令直达社区和全科网格。",
        "市委编办"
      ],
      [
        "迭代基层治理四平台",
        "6月下旬",
        "将原基层治理四平台迭代为“党建统领、经济生态、平安法治、公共服务”四个平台",
        "未开始",
        "编制《温州市“基层治理四平台”迭代升级技术方案》，已完成“党建统领、经济生态、平安法治、公共服务”四条跑道整体驾驶舱构建。",
        "市委政法委"
      ],
      [
        "迭代基层治理四平台",
        "持续推进",
        "健全完善乡镇（街道）综合信息指挥室建设，统筹协调指挥“基层治理四平台”及区域内各条块的管理服务力量，建立健全机制",
        "未开始",
        "督促各地健全完善乡镇（街道）综合信息指挥室建设，统筹协调指挥“基层治理四平台”及区域内各条块的管理服务力量。",
        "市委编办"
      ],
      [
        "深化基层网格治理",
        "持续推进",
        "推动建立“双纳入”机制，专职网格员统一纳入社区工作者队伍管理，社区工作者纳入网格工作，落实包网入户",
        "未开始",
        "出台《党建统领网格智治推进基层治理体系和治理能力现代化<指导意见>任务责任清单》，各县（市、区）第一时间开展“双纳入”机制研究，推进专职网格员统一纳入社区工作者队伍管理；召开党建统领网格智治工作视频调度会，对全市网格划分逐个进行过堂会审，统筹推进专职网格员纳入社区工作者队伍。",
        "市委组织部\n市委政法委"
      ],
      [
        "深化基层网格治理",
        "6月下旬",
        "指导微网格建设，深入推进专属网格，提升对商务楼宇、商圈市场、企业园区、物流仓储等“八大类区域”的疫情防控水平和日常管理能力，建设微网格工作室",
        "已完成",
        "制发《关于推进村社治理阵地和专属网格建设的工作提示单》，创新构建1764个专属网格并重新调整网格划分边界，明确在全市范围内建立15个（微网格工作室）示范点。",
        "市委组织部\n市委政法委"
      ],
      [
        "深化基层网格治理",
        "6月底",
        "严格网格事项准入，明确职责界限，合理确定网格员排查事项内容",
        "已完成",
        "实行全科网格、专属网格、微网格等网格准入制和任务清单制，完成第二轮网格划分，明确新增事项“县级审核市级备案”制度，制发《温州市第一批（平安法治）网格准入事项清单（征求意见稿）》。",
        "市委政法委\n市委组织部\n市民政局"
      ],
      [
        "深化基层网格治理",
        "持续推进",
        "选优配强网格力量，打造“基础力量+专业力量+社会力量+智能感知”网格团队",
        "未开始",
        "制发《关于进一步建强“一网格三队伍”提升村社治理能力的实施方案》。",
        "市委组织部\n市委政法委"
      ]
    ], //
    "list3": [
      [
        "规范应用贯通清单",
        "6月底",
        "根据市数字化改革重大应用“一本账”，梳理编制第一批延伸到基层的事项清单、应用清单",
        "已完成",
        "印发《关于开展“1612”体系贯通应用清单和事项清单梳理工作的通知》，梳理出第一批5项事项清单、应用清单。",
        "市委编办"
      ],
      [
        "规范应用贯通清单",
        "持续推进",
        "完善事项动态管理和退出机制，做好重大应用增量开发、迭代升级，强化适配性创新，推进减负赋能",
        "未开始",
        "会同市委政法委、市民政局、市司法局、市综合行政执法局等单位,对贯通应用事项的必要性、合规性、合法性以及基层承接能力进行论证，建立动态管理和退出机制。",
        "市委编办\n市大数据局"
      ],
      [
        "升级数据共享和业务协同网关",
        "6月下旬",
        "对各类业务接口开展协议标准化、编码标准化和命名标准化工作，实现全量事件标准化梳理和接入",
        "已完成",
        "已形成接入规范，包含协议标准化、编码标准化和命名标准化相关要求。",
        "市大数据局"
      ],
      [
        "升级数据共享和业务协同网关",
        "持续推进",
        "利用网关事件订阅、接口调度、界面集成等功能，打通省级、市级、区县的业务系统，实现一件事高效闭环处置",
        "未开始",
        "已完成省定首批4个重大应用的贯通工作并通过验收，总体进度居全省第一梯队，并按期完成应用贯通业务培训和业务落地保障制度编制工作。",
        "市大数据局"
      ]
    ], //
    "list4": [
      [
        "形成基层治理“一件事”一本账",
        "6月底",
        "全量承接省基层治理“一件事”一本账，梳理形成市级层面基层治理“一件事”一本账S0",
        "已完成",
        "梳理形成《温州市基层治理“一件事”一本账S0》，其中包含省定15项“一件事”以及创新谋划的市定20项“一件事”。",
        "市委改革办\n市委编办"
      ],
      [
        "形成基层治理“一件事”一本账",
        "持续推进",
        "编制“一件事”工作指南、协同流程图等",
        "未开始",
        "目前，瓯海、永嘉、龙港等地分别编制完成了废弃机动车处置、村级工程管理、噪音处置等“一件事”工作指南和协同流程图。",
        "市委改革办"
      ],
      [
        "推进基层治理“一件事”场景化应用",
        "持续推进",
        "推进省级“一件事”场景化应用贯通落地，加快市级特色“一件事”场景化应用开发建设",
        "未开始",
        "目前，省级15个“一件事”场景化应用均未作有关具体部署；市级20个“一件事”场景化应用均在迭代开发中。",
        "市委改革办"
      ],
      [
        "推进基层治理“一件事”场景化应用",
        "持续推进",
        "根据省统一部署，依托基层治理四平台，推动基层治理“一件事”全流程线上运行",
        "未开始",
        "目前，建筑垃圾处置监管、宠物（犬类）监管等“一件事”已在“大综合一体化”执法监管数字应用上运行；瓯海、文成、龙港“三个中心”指挥平台上也已在推动一批基层治理“一件事”上线。",
        "市委改革办"
      ]
    ], //
    "list5": [
      [
        "统筹建设基层智治大脑",
        "6月底",
        "参照《基层治理大脑建设指南S0》，制定基层治理大脑建设规范",
        "已完成",
        "统筹推进基层智治大脑与“一网统管”建设，已初步确定迭代优化方案“一件事”上线。",
        "市大数据局"
      ],
      [
        "推进基层治理“一件事”场景化应用",
        "持续推进",
        "利用分词、聚类等通用算法，训练形成话题检测、词向量等模型，建立自动派单推荐等智能模块，实现重点人员/事件发现、派单推荐和舆情热点智能分析",
        "未开始",
        "统筹开发NLP自然语言智能分析平台，针对归集的全量事件，具备事件自动分类/统计/排序、热点智能分析、重点人/事/场所发现等功能，并且在部分区县试点使用。",
        "市大数据局"
      ],
      [
        "推进基层治理“一件事”场景化应用",
        "持续推进",
        "利用人流密度检测、高空抛物检测等通用算法，训练形成人员聚集预警、违规违法行为识别等模型，提升“基层治理大脑”社会矛盾纠纷事件的办理效率",
        "未开始",
        "对各区县的算法、模型进行归集，并基于全市事件，进一步进行训练优化，谋划建设算法模型共建共享平台。",
        "市大数据局"
      ],
      [
        "推进基层治理“一件事”场景化应用",
        "持续推进",
        "根据县（市、区）实际场景，选择部分区域摄像头与智能算法，提供AI智能识别能力，提高监管效率",
        "未开始",
        "鹿城、文成、龙港等区县基于雪亮摄像头的视频资源，进行IA智能分析，共上线100多项行为分析算法，形成广场舞噪音整治、占道经营管理等一件事处理流程。",
        "市大数据局"
      ]
    ], //推进基层智治大脑建设（市大数据局牵头，市委办公室协同）
    "list6": [
      [
        "推动综合行政执法事项清单动态管理",
        "5月底",
        "梳理完成“执法目录总清单+综合执法清单+专业执法清单”，基本形成成熟完备的全市整体执法事项清单，加强对目录的动态化、体系化、标准化管理",
        "已完成",
        "已完成综合执法清单和乡镇执法目录清单地梳理；执法目录总清单和专业执法事项清单，据市委编办的反馈正由省级单位统一梳理，尚未完成。",
        "市综合行政执法局"
      ],
      [
        "推动综合行政执法事项清单动态管理",
        "6月底",
        "在完成省第一、二批749项划转事项公告、交接协议签订的基础上，完成市级扩展目录431项事项的公告、交接协议的签订等工作",
        "已完成",
        "已完成省第一、二批749项划转事项公告并签订相关交接协议，市级扩展目录已完成前期所有准备工作，待市政府常务会议通过后，即可正式公告。",
        "市综合行政执法局"
      ],
      [
        "推动综合行政执法事项清单动态管理",
        "持续推进",
        "做好省综合行政执法目录（2022年）梳理、划转、公告、交接等工作",
        "未开始",
        "目前，省综合行政执法目录（2022年）尚未正式公布。",
        "市综合行政执法局"
      ],
      [
        "推进乡镇（街道）“一支队伍管执法”",
        "5月底",
        "制定出台《关于深入推进乡镇（街道）“一支队伍管执法”的通知》",
        "未开始",
        "出台《关于深入推进乡镇（街道）“一支队伍管执法”的通知》。",
        "市委编办"
      ],
      [
        "推进乡镇（街道）“一支队伍管执法”",
        "持续推进",
        "在市、县（除龙港市外）两级统一整合形成“1+8”执法构架的基础上，建立更加精减高效的县级执法构架",
        "未开始",
        "已在市、县（除龙港市外）两级统一整合形成“1+8”执法构架。",
        "市委编办"
      ],
      [
        "推进乡镇（街道）“一支队伍管执法”",
        "持续推进",
        "指导各县（市、区）建立派驻乡镇（街道）执法编制、人员“县属乡用共管”机制",
        "未开始",
        "制发《关于开展“大综合一体化”行政执法改革机构编制相关工作过程性督查的通知》，指导各地出台“县属乡用共管”机制。",
        "市委编办"
      ],
      [
        "推进乡镇（街道）“一支队伍管执法”",
        "持续推进",
        "按照派驻、赋权、“1+X”辐射三种形式，8月底前完成50个以上镇街执法事项依法赋权，年底前实现镇街“一支队伍管执法”全覆盖",
        "未开始",
        "除龙港市外，指导11个县（市、区）规范设置赋权镇街行政执法队伍，截止6月29日，已有44个镇街进行公告赋权。",
        "市综合行政执法局\n市委编办"
      ],
      [
        "推进乡镇（街道）“一支队伍管执法”",
        "持续推进",
        "制定我市基层中队（站所）规范化建设制度，探索建立统一规范的市级地方标准，提升基层执法规范化建设水平",
        "未开始",
        "基层队所规范化建设地方标准第一部分已通过专家立项论证。",
        "市综合行政执法局\n市委编办"
      ],
      [
        "建立行政执法制约监督体系",
        "持续推进",
        "建设行政执法领域公权力大数据监督多跨协同场景，推动各部门、各领域、各层级行权和监督数据共享贯通，行政执法权行使全流程在线运行、留痕可溯、监督预警，强化监督的再监督",
        "未开始",
        "未正式贯通使用。",
        "市综合行政执法局"
      ],
      [
        "构建执法监管数字应用",
        "6月底",
        "承接省级贯通与融合工作，上线试运行全省数字化执法管理平台“1.0版”",
        "未完成",
        "目前，全省统建的数字化执法管理平台尚未正式贯通使用。",
        "市综合行政执法局"
      ],
      [
        "构建执法监管数字应用",
        "持续推进",
        "谋划建设本地执法个性化集成应用，与“基层治理四平台”双向互通，推动各部门、各领域、各层级行权和监督数据共享贯通",
        "未开始",
        "已完成数字城管平台与基层治理四平台初步对接联调。",
        "市综合行政执法局"
      ],
      [
        "构建执法监管数字应用",
        "持续推进",
        "在已有“监管一件事”目录清单的基础上，持续征集“监管一件事”场景应用，不断完善我市“监管一件事”清单，形成我市特色的地方“监管一件事”应用场景库",
        "未开始",
        "已梳理集成市级62件“监管一件事”清单。",
        "市综合行政执法局"
      ]
    ], //“
    "list7": [
      [
        "健全村（居）民自治机制",
        "持续推进",
        "贯彻《浙江省村民代表工作规程（试行）》，充分发挥村民代表作用",
        "未开始",
        "6月1日，在“温州民政”“智慧村社”等系统平台发布“一图读懂《浙江省村民代表工作规程（试行）》”。",
        "市民政局"
      ],
      [
        "健全村（居）民自治机制",
        "持续推进",
        "迭代升级、推广智慧村社应用,提升“村（居）民代表会议”等模块规范性、实用性与智能性，构建完整的重大事项“五议两公开”闭环管理",
        "未开始",
        "目前已完成智慧村社应用中重大事项“五议两公开”-“村（居）民代表会议”“财务公开”“党务公开”模块的全面升级。",
        "市民政局"
      ],
      [
        "健全村（居）民自治机制",
        "持续推进",
        "开展基层减负“回头看”行动，明确村社事务“四部门联审”制，推进村社“六清单一流程”规范运行，深化村社“万能章”整治，推动台账自然留痕",
        "未开始",
        "开展温州市涉村社事项清单（2022年版）修订工作，已完成意见征求工作。",
        "市民政局"
      ],
      [
        "推进基层法治建设",
        "6月下旬",
        "深入推进“八五”普法规划贯彻实施，开展“ 法助共富 法护平安”专项普法活动；以民法典进乡村为重点，开展“美好生活·民法典相伴”主题宣传活动",
        "已完成",
        "开展“ 法助共富 法护平安”专项普法活动593场，覆盖人数13.7万，开展“美好生活·民法典相伴”主题宣传活动316场，覆盖人数6.82万。",
        "市司法局"
      ],
      [
        "推进基层法治建设",
        "6月底前",
        "开展“调解促稳定 喜迎二十大”矛盾纠纷调解专项行动，认真研究矛盾纠纷现状，在全市范围内进行动员部署",
        "已完成",
        "召开专项行动动员部署会议，结合各地矛盾纠纷现状，依托县-乡镇（街道）-村（社区）三级人民调解委员会开展矛盾纠纷大排查，及时有效预防化解重大矛盾纠纷和风险隐患。",
        "市司法局"
      ],
      [
        "推进基层法治建设",
        "持续推进",
        "推进省级“金口碑”人民调解区域品牌和金牌人民解调工作室创建，推进乡镇（街道）司法所基层联络点建设，年内实现各县（市、区）“枫桥式”司法所全覆盖",
        "未开始",
        "6月，全市共推荐申报金牌调解工作室16家，“金口碑”区域品牌7家；筛选39家司法所，探索打造法治化综合司法所；验收评估龙湾、洞头、瑞安、永嘉四地“枫桥式”司法所。",
        "市司法局"
      ],
      [
        "推进基层法治建设",
        "持续推进",
        "积极推动国家级、省、市级民主法治村（社区）创建，开展调查摸底，动员县市区积极创建，下发创建申报文件，组织考核验收命名",
        "未开始",
        "制发《关于组织开展2022年度市级民主法治村（社区）申报工作的通知》，拟创建市级民主法治村（社区）570个。",
        "市司法局"
      ],
      [
        "推进基层法治建设",
        "持续推进",
        "组建公共法律服务队，推广基层在线公证服务模式，完善远程视频公证服务机制，推广运用“微仲裁”",
        "未开始",
        "截至目前，公共法律服务队进村（社）提供法治宣传和公证咨询10297次；已在11个国家18个城市建立21个海外公证联络点;“微仲裁”更名为“仲裁在线”，正在进行迭代升级。",
        "市司法局"
      ],
      [
        "推进基层法治建设",
        "持续推进",
        "开展重大行政决策管理示范创建，落实重大行政决策目录化管理机制，建立重大行政决策公众参与和风险评估制度，落实专家智库队伍建设",
        "未开始",
        "第一批市政府重大行政决策目录已公布完毕;聘请98名市政府重大行政决策咨询论证专家，积极为政府重大行政行为，重大合同、项目等提供法律意见。",
        "市司法局"
      ],
      [
        "推进基层法治建设",
        "持续推进",
        "培育和树立先进典型，促进“法律明白人”“法治带头人”培养工程向纵深推进",
        "未开始",
        "已组织县(市、区）开展“法治带头人”“法律明白人”遴选工作，要求农村“法律明白人”不少于3人。",
        "市司法局"
      ],
      [
        "发挥德治先导作用",
        "持续推进",
        "健全村（社区）道德评议机制，出台温州标准",
        "未开始",
        "印发《2022年度温州市乡风文明指数测评实施方案》，组织开展2022年温州市文明村镇、文明示范村、社区类文明单位和文明家庭评选活动，将道德评议机制列入考评内容。",
        "市委宣传部（文明办）"
      ],
      [
        "发挥德治先导作用",
        "6月下旬",
        "开展道德模范、身边好人等道德典型选树,针对当前疫情防控形势，开展“浙江好人·疫线面孔”主题宣传，选树和集中宣传基层一线先进典型",
        "已完成",
        "刊登16位“浙江好人·疫线面孔”和“温州好人·疫线面孔”的先进事迹,集中宣传了基层一线先进典型。",
        "市委宣传部（文明办）"
      ],
      [
        "发挥德治先导作用",
        "持续推进",
        "探索推进“信用+乡村治理”，健全守信联合激励和失信联合惩戒机制，开展重点领域失信问题专项治理，推广“瓯江分”“城信档案”“道德银行”等诚信品牌",
        "未开始",
        "健全守信联合激励和失信联合惩戒机制，开展重点领域失信问题专项治理，划定信用等级和分数区间，建立个人诚信分引导市民应用诚信分；已为全市37.31万家企业、1.5万家政府机关、事业单位、社会团体等其他法人、83.82万家个体工商户和830万户籍人口建立了信用档案；通过“最美温州人”贷款授信实施方案和巾帼共富贷支持道德模范、“最美温州人”系列、五星志愿服务者、巾帼建工标兵等道德典型的信用贷款。",
        "市委宣传部（文明办）"
      ],
      [
        "提升基层智治能力",
        "持续推进",
        "梳理排摸“四治融合”城乡基层治理的重点应用场景，进一步整合基层治理数据资源，以智治支撑来提升自治、法治、德治相融合的治理效能",
        "未开始",
        "排摸自治、法治、德治相关的小切口应用场景及“四治融合”相关综合性数字化应用。",
        "市委农办"
      ],
      [
        "提升基层智治能力",
        "持续推进",
        "优化推广“四治融合”现有应用场景，建立与“基层治理四平台”的双向流转机制",
        "未开始",
        "优化推广浙农经管应用，建立与“小微权力在线审批”的双向流转，已在永嘉、平阳、泰顺等多地进行试点。",
        "市委农办"
      ],
      [
        "提升基层智治能力",
        "持续推进",
        "围绕基层组织、基础设施、基本公共服务、主导产业、主体风貌、主题文化等“三基三主”建设核心，新建未来乡村35个，打造共同富裕现代化基本单元",
        "未开始",
        "印发《2022年温州市未来乡村建设工作方案》《2022年温州市未来乡村建设比拼晾晒评价办法》，新开工建设未来乡村42个，前后两批共47个村入围省试点创建名单，5个未来乡村获评全省首批未来乡村，数量全省并列第一。",
        "市委农办"
      ],
      [
        "提升基层智治能力",
        "持续推进",
        "依托浙江省集体经济数字化平台，健全基础数据库，推进应用模块规范使用，实现集体资产全网监督",
        "未开始",
        "第一时间部署省级系统的新模块应用，有效串联贯通市县乡村四级，已在线支付金额302亿元。",
        "市委农办"
      ]
    ] //
  }
  for (const key in resData) {
    // list
    const dataList = []
    resData[key].forEach((item) => {
      // row
      const dataRow = {}
      item.forEach((subItem, index) => {
        dataRow['col' + index] = subItem
      })
      dataList.push(dataRow)
    })
    tableList.value.push(dataList)
  }
}

const objectSpanMethod = ({
  row,
  column,
  rowIndex,
  columnIndex,
}) => {
  if (columnIndex === 0) {
    if (rowIndex % 2 === 0) {
      return {
        rowspan: 2,
        colspan: 1,
      }
    } else {
      return {
        rowspan: 0,
        colspan: 0,
      }
    }
  }
}

onMounted(() => {
  getData()
})
</script>

<template>
  <Popup
    v-model="visible"
    title="基层智治系统双月工作任务进度表"
  >
    <div class="assessment-pop">
      <template v-for="(item, index) in tableList">
        <div class="title">{{ titleList[index] }}</div>
        <DynamicTable
          :columns="columns"
          :data="item"
          :span-method="objectSpanMethod"
          border
        />
      </template>
    </div>
  </Popup>
</template>

<style lang="scss" scoped>
.assessment-pop {
  height: 100%;
  overflow: auto;

  .title {
    margin-bottom: 14px;
    display: flex;
    align-items: center;
    height: 22px;
    font-size: 16px;
    font-family: PingFangSC-Medium, PingFang SC;
    font-weight: 500;
    color: #FFFFFF;
    line-height: 22px;

    &::before {
      content: ' ';
      display: block;
      width: 12px;
      height: 12px;
      margin: 10px;
      border-radius: 6px;
      background: #409EFF;
    }
  }

  --ep-bg-color: #062F62;
  --ep-text-color-secondary: #CCF1FF;
  --ep-fill-color-blank: #060A1E;
  --ep-border-color-lighter: rgba(0, 41, 81, 0.5000);
  --ep-fill-color-light: #05183F;
  --ep-text-color-regular: #fff;

  // :deep(.ep-table .ep-table__header) {}

  // :deep(.ep-table th.ep-table__cell) {
  //   color: #CCF1FF;
  //   background: #062F63;
  //   border-bottom: 0 !important;
  // }

  // :deep(.ep-table--enable-row-transition .ep-table__body td.ep-table__cell) {
  //   color: #fff;
  //   background: #060A1F;
  //   border-bottom: 1px solid rgba(0, 41, 81, 0.5000);
  // }
}
</style>

<style lang="scss">
</style>